#
# Задачи
#
#     Описать таблицу фильм: id, название, длительность, режиссер, жанр фильма.
#     Обратите внимание на то, что у фильма может быть более одного жанра, а к одному
#     жанру может относится более, чем один фильм.

#     Описать таблицу песня: id, название, длительность, певец. При этом у песни может быть
#     более одного певца, а певец мог записать более одной песни.

#     Реализовать таблицу машина: модель, производитель, цвет, цена
#         Описать отдельную таблицу производитель: id, название, рейтинг.
#         Описать отдельную таблицу цвета: id, название.
#
#     У одной машины может быть только один производитель, а у производителя — много машин.
#     У одной машины может быть много цветов, а у одного цвета может быть много машин.
#     Добавить в БД из пункта 6.2. таблицу военно-обязанных по типу того,
#     как мы описали отдельную таблицу DisabledEmployee.
#
